#define _CRT_SECURE_NO_WARNINGS // Чтобы компилятор не выдовал ошибок
#include <stdio.h> //  Подключаем заголовочный файл stdio.h
#include <string.h> // для strlen
#include <locale.h> // Подключаем заголовочный файл locale.h чтобы был русский язык
//#define STRLEN 512              //максимальная длина строки
#include <stdlib.h>
int main()
{
	setlocale(LC_ALL, "Russian");
	// Переменная, в которую будет помещен указатель на созданный
	// поток данных 
	FILE *mf,*EndFile;
	int counter = 0;
	// Переменная, в которую поочередно будут помещаться считываемые строки
	char str[256];
	char TempSymbol; // Временная переменая для хранения символа
	//Указатель, в который будет помещен адрес массива, в который считана 
	// строка, или NULL если достигнут коней файла или произошла ошибка
	char *estr;
	// Открытие файла с режимом доступа «только чтение» и привязка к нему 
	// потока данных
	printf("Открытие файла : ");
	mf = fopen("One.txt", "r");
	EndFile = fopen("End_Feil.txt", "w");
	// Проверка открытия файла
	if (mf == NULL) { printf("ошибка\n"); return -1; }
	else printf("выполнено\n");
	printf("Считаны строки : \n");
	//Чтение (построчно) данных из файла в бесконечном цикле
	while (1)
	{
		// Чтение одной строки  из файла
		estr = fgets(str, sizeof(str), mf);

		//Проверка на конец файла или ошибку чтения
		if (estr == NULL)
		{
			// Проверяем, что именно произошло: кончился файл
			// или это ошибка чтения
			if (feof(mf) != 0)
			{
				//Если файл закончился, выводим сообщение о завершении 
				//чтения и выходим из бесконечного цикла
				printf("\nЧтение файла закончено\n");
				break;
			}
			else
			{
				//Если при чтении произошла ошибка, выводим сообщение 
				//об ошибке и выходим из бесконечного цикла
				printf("\nОшибка чтения из файла\n");
				break;
			}
		}
		//Если файл не закончился, и не было ошибки чтения 
		//выводим считанную строку  на экран
		printf("%s\n", str);
		char* words = strtok(str, " ,.-");// Функция strtok выполняет поиск лексем в строке
		while (words != NULL)// цикл в котором мы разделяем основную строку в слова
		{
			counter++;
			TempSymbol = words[0]; // во временую перемнную присваеваем первый символ 
			words[0] = words[strlen(words) - 1]; // первый символ в слове заменяем на последную
			words[strlen(words) - 1] = TempSymbol;// последний символ в слове заменяем на первую
			printf("%s\n", words);// вывод резултата через новую строку
			fprintf(EndFile, "%s\n", words);
			words = strtok(NULL, " ,.-"); // разделения строки на лексемы
		}
	}

	// Закрываем файл
	printf("Закрытие файла : ");
	fclose(EndFile);
	if (fclose(mf) == EOF) printf("ошибка\n");
	else printf("выполнено\n");
	system("PAUSE");
	return 0;
}