#define _CRT_SECURE_NO_WARNINGS // Чтобы компилятор не выдовал ошибок 
#include <stdio.h> // Подключаем заголовочный файл stdio.h 
#include <locale.h> // Подключаем заголовочный файл locale.h чтобы был русский язык 

int main() { 
	setlocale(LC_ALL, "Russian"); // Функция чтобы в консоли был Русский язык 
	int x = 0; // объявляем целочисленную переменную x которая ровна 0 
	double a, b; // объявляем пременные с плавающей запятой a,b 
	printf("Введите число в метрах \n"); // Вывод на экран иформаций 
	scanf("%d", &x); // Функция ввода информаций 
	a = x*5.62; // Вычесляем пяди 
	printf("Ответ в пядях = %f \n", a); // Вывод на экран иформаций 
	b = a * 0.25; // Вычесляем аршины 
	printf("Ответ в аршинах %f \n", b); // Вывод на экран иформаций
	getchar(); // Функция чтобы программа сразу не закрывалось 
	getchar(); // Функция чтобы программа сразу не закрывалось 
	return 0;// функция возврощает 0 
}